# tap homebrew function
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# tap 3rd party function
tap "jlhonora/lsusb"
tap "osx-cross/avr"
tap "beeftornado/rmtree"
tap "px4/px4"

# 環境構築系ツールインストール
## mas
brew "mas"
## mackup
brew "mackup"
## 1password
mas "1Password 7", id: 1333542190

# 必要なものインストール: brew
brew "osx-cross/avr/avr-gcc@8", link: true
brew "px4/px4/gcc-arm-none-eabi"
brew "avrdude"
brew "dfu-programmer"
brew "dfu-util"
brew "ext4fuse"
brew "git"
brew "sqlite"
brew "python"
brew "mysql"
brew "nmap"
brew "nodenv"
brew "node-build"
brew "sox"
brew "tig"
brew "tree"
brew "watch"
brew "watchman"
brew "wget"
brew "yarn"
brew "zsh"
brew "zsh-completions"

# 必要なものインストール: cask
cask "osxfuse"
## 0xed
cask "0xed"
## alfred
cask "alfred"
## android-file-transfer
cask "android-file-transfer"
## android studio
cask "android-studio"
## app cleaner
cask "appcleaner"
## arduino
cask "arduino"
## bettertouchtool
cask "bettertouchtool"
## cheatsheet
cask "cheatsheet"
## DB Browser for sqlite
cask "db-browser-for-sqlite"
## discord
cask "discord"
## duet
cask "duet"
## eqMac
#cask "eqmac"
## gimp
cask "gimp"
## google-backup-and-sync
cask "google-backup-and-sync"
## google-chrome-beta
cask "google-chrome-beta"
## google-chrome-canary
cask "google-chrome-canary"
## google日本語入力
cask "google-japanese-ime"
## gyazo
cask "gyazo"
## hyper
cask "hyper"
## insomnia
cask "insomnia"
## iterm2
cask "iterm2"
## kap
cask "kap"
## mono-mdk
cask "mono-mdk"
## mysqlworkbench
cask "mysqlworkbench"
## ngrok
cask "ngrok"
## nightowl
cask "nightowl"
## slack
cask "slack"
## steam
cask "steam"
## teamviewer
cask "teamviewer"
## touch-bar-simulator
cask "touch-bar-simulator"
## tunnelblick
cask "tunnelblick"
## visual studio
cask "visual-studio"
## vscode
cask "visual-studio-code"
## vivaldi
cask "vivaldi"
## wireshark
cask "wireshark"

# 必要なものインストール: mas
## com.apple.iWork.Pages (8.0)
mas "Pages", id: 409201541
## com.apple.iWork.Numbers (6.0)
mas "Numbers", id: 409203825
## com.apple.iWork.Keynote (9.0.2)
mas "Keynote", id: 409183694
## com.apple.iMovieApp (10.1.11)
mas "iMovie", id: 408981434
## com.apple.garageband10 (10.3.2)
mas "GarageBand", id: 682658836
## com.crowdcafe.windowmagnet (2.4.3)
mas "Magnet", id: 441258766
## jp.crimsontech.voidol (1.0.2)
mas "Voidol", id: 1456342457
## com.readitlater.PocketMac (1.8.2)
mas "Pocket", id: 568494494
## de.milchimgemuesefach.Display-Menu (2.2.3)
mas "Display Menu", id: 549083868
## jp.naver.line.mac (5.16.2)
mas "LINE", id: 539883307
## com.manytricks.KeyCodes (2.1)
mas "Key Codes", id: 414568915
## Helium (2.0)
mas "Helium", id: 1054607607

## xcode
mas "Xcode", id: 497799835
